<template>

  <div class="dashboard-container">
    <h2>
      使用说明 Handbook
    </h2>
    <hr>

    <h3>
      系统管理
    </h3>
    <pre>    
        系统有一个超级管理员，拥有最高权限。可新增、修改、查看、删除管理员、普通用户。可新增、修改、查看、删除常见样本，
    可新增、修改、查看、删除案件物证，可查看分析结果。
        系统有多个管理员。可新增、修改、查看、删除普通用户。可新增、修改、查看、删除常见样本，可新增、修改、查看、删除案件物证，
    可查看分析结果。
        系统有多个普通用户。无管理人员的权限。可查看常见样本，可新增、修改、查看、删除案件物证，可查看分析结果。
    </pre>
    <hr>
    <h3>
      主要功能 —— 常见样本
    </h3>
    <pre>
        点击'新增样本'按钮可进入新增样本界面，左侧输入样本基本信息，右侧输入样本检测数据。
        新增样本完毕后，点击'更新结果'按钮，更新物证的分析结果。
        点击'详细'按钮，查看样本详细信息。点击'编辑'按钮，修改样本基本信息。点击'删除'按钮，删除样本。
    </pre>
    <hr>
    <h3>
      主要功能 —— 案件物证
    </h3>
    <pre>
        点击'新增物证'按钮可进入新增物证界面，左侧输入物证基本信息，右侧输入物证检测数据。
        新增物证完毕后，自动分析物证。
        点击'详细'按钮，查看物证详细信息。点击'编辑'按钮，修改物证基本信息。点击'删除'按钮，删除物证。
    </pre>
    <hr>
    <h3>
      主要功能 —— 分析研判
    </h3>
    <pre>
        点击'分析处理'按钮，查看物证的详细分析结果。
        点击'绘图'，绘制选中的物证及其匹配样本的曲线图。
    </pre>
  </div>
</template>

<script>
// import { mapGetters } from 'vuex'

export default {
  name: '',
  mounted: function() {

  }
  // computed: {
  //   ...mapGetters([
  //     'name',
  //     'role',
  //     'avatar'
  //   ])
  // }
}
</script>

<style rel="stylesheet/scss" lang="scss" scoped>
.dashboard {
  &-container {
    margin: 30px;
  }
  &-text {
    font-size: 30px;
    line-height: 46px;
  }
}
</style>
